# -*- coding:utf-8 -*-  
'''
Created on 2017年11月16日

@author: Administrator
'''
from functions.SearchInternet import search_in_baike
s1 ='''
"题目": "佳人",
 "关键字": "唐诗三百首，赞美，闺怨，女子",
 "朝代": "唐代",
 "作者": "杜甫",
 "材料": "译文有位举世无双的美人，隐居在空旷的山谷中。她说自己是高门府第的女子，飘零沦落到与草木相依。过去关中一带遭遇战乱，家里的兄弟全被乱军杀戮。官居高位又有什么用？自己兄弟的尸骨都无法收埋。世俗人情都厌恶衰败的人家，万事就像随风而转的烛火。丈夫是个轻薄子弟，抛弃了我又娶了个美丽如玉的新人。合欢花尚且知道朝开夜合，鸳鸯鸟成双成对从不独宿。丈夫只看见新人欢笑，哪里听得到旧人哭泣？泉水在山里是清澈的，出了山就浑浊了。让侍女典卖珠宝维持生计，牵把青萝修补茅屋。摘下来的花不展开阅读全文∨译文有位举世无双的美人，隐居在空旷的山谷中。她说自己是高门府第的女子，飘零沦落到与草木相依。过去关中一带遭遇战乱，家里的兄弟全被乱军杀戮。官居高位又有什么用？自己兄弟的尸骨都无法收埋。世俗人情都厌恶衰败的人家，万事就像随风而转的烛火。丈夫是个轻薄子弟，抛弃了我又娶了个美丽如玉的新人。合欢花尚且知道朝开夜合，鸳鸯鸟成双成对从不独宿。丈夫只看见新人欢笑，哪里听得到旧人哭泣？泉水在山里是清澈的，出了山就浑浊了。让侍女典卖珠宝维持生计，牵把青萝修补茅屋。摘下来的花不愿插在头上，喜欢采折满把的柏枝。天气寒冷，衣衫显得分外单薄，黄昏时分，独自倚在修长的竹子上。韵译有一个美艳绝代的佳人，隐居在僻静的深山野谷。她说：“我是良家的女子，零落漂泊才与草木依附。想当年长安丧乱的时候，兄弟遭到了残酷的杀戮。官高显赫又有什么用呢，不得收养我这至亲骨肉。世情本来就是厌恶衰落，万事象随风抖动的蜡烛。没想到夫婿是个轻薄儿，又娶了美颜如玉的新妇。合欢花朝舒昏合有时节，鸳鸯鸟雌雄交颈不独宿。朝朝暮暮只与新人调笑，那管我这个旧人悲哭？！”在山的泉水清澈又透明，出山的泉水就要浑浊浊。变卖首饰的侍女刚回来，牵拉萝藤修补着破茅屋。摘来野花不爱插头打扮，采来的柏子满满一大掬。天气寒冷美人衣衫单薄，夕阳下她倚着长长青竹。注释（1）绝代：冠绝当代，举世无双。佳人：貌美的女子。（2）幽居：静处闺室，恬淡自守。（3）零落：飘零沦落。依草木：住在山林中。（4）丧乱：死亡和祸乱，指遭逢安史之乱。（5）官高：指娘家官阶高。（6）骨肉：指遭难的兄弟。（7）转烛：烛火随风转动，比喻世事变化无常。（8）夫婿：丈夫。（9）新人：指丈夫新娶的妻子。（10）合昏：夜合花，叶子朝开夜合。（11）鸳鸯：水鸟，雌雄成对，日夜形影不离。（12）旧人：佳人自称。（13）卖珠：因生活穷困而卖珠宝。（14）牵萝：拾取树藤类枝条。也是写佳人的清贫。（15）采柏：采摘柏树叶。动：往往。（16）修竹：高高的竹子。比喻佳人高尚的节操。▲杜甫的《佳人》既反映客观存在的社会问题，又体现了诗人的主观寄托。诗中人物悲惨的命运与高尚的情操形成了强烈的对照，既让人同情，又令人敬佩。诗人用“赋”的手法描写佳人悲苦的生活，同时用“比兴”的手法赞美了她高洁的品格。全诗含蓄蕴藉，耐人寻味，感人肺腑，能强烈地引起读者的共鸣，是杜甫诗中的佳作。　　全诗分三段，每段八句。第一段写佳人家庭的不幸遭遇。第二段，佳人倾诉被丈夫抛弃的大不幸。第三段，赞美佳人虽遭不幸，尚能洁身自持的高尚情操。　　“绝代有佳人，幽居在空谷。自云良家子，零落依草木。”开头两句点题，上句写其貌之美，下句写其品之高。又以幽居的环境，衬出佳展开阅读全文∨杜甫的《佳人》既反映客观存在的社会问题，又体现了诗人的主观寄托。诗中人物悲惨的命运与高尚的情操形成了强烈的对照，既让人同情，又令人敬佩。诗人用“赋”的手法描写佳人悲苦的生活，同时用“比兴”的手法赞美了她高洁的品格。全诗含蓄蕴藉，耐人寻味，感人肺腑，能强烈地引起读者的共鸣，是杜甫诗中的佳作。　　全诗分三段，每段八句。第一段写佳人家庭的不幸遭遇。第二段，佳人倾诉被丈夫抛弃的大不幸。第三段，赞美佳人虽遭不幸，尚能洁身自持的高尚情操。　　“绝代有佳人，幽居在空谷。自云良家子，零落依草木。”开头两句点题，上句写其貌之美，下句写其品之高。又以幽居的环境，衬出佳人的孤寂，点出佳人命运之悲，处境之苦，隐含着诗人“同是天涯沦落人”的慨叹。以上四句是是第三人称的描状，笔调含蓄蕴藉。　　“关中昔丧乱，兄弟遭杀戮。官高何足论，不得收骨肉。”从此处以下转为第一人称的倾诉，语气率直酣畅。当年安史之乱，长安沦陷，兄弟们惨遭杀戮。官位高也没有什么用，他们死后连尸骨都得不到收殓。天宝十五载（756年）六月，安史叛军攻陷长安。“官高”呼应上文的“良家子”，强调绝代佳人出自贵人之家。　　“世情恶衰歇，万事随转烛。夫婿轻薄儿，新人美如玉。”这四句托物兴感，刻画世态炎凉，人情冷暖。宋代的刘辰翁评论说：“闲言余语，无不可感。”“转烛”，以风中的烛光，飘摇不定，比喻世事转变、光景流逝的迅速。　　“合昏尚知时，鸳鸯不独宿。但见新人笑，那闻旧人哭。”诗人以形象的比喻，写负心人的无义绝情，被抛弃的人伤心痛苦。在佳人倾诉个人不幸、慨叹世情冷漠的言辞中，充溢着悲愤不平的情绪。一“新”一“旧”、一“笑”一“哭”，强烈对照，被遗弃女子声泪俱下的痛苦之状，如在目前。夜合花朝开夜合，所以说“知时”。鸳鸯则多雌雄成对，生活在水边。　　“在山泉水清，出山泉水浊。侍婢卖珠回，牵萝补茅屋。”这几句似悲似诉，佳人自言自誓，有矜持慷慨、修洁端丽之意。同时，可见佳人居家环境的简陋清幽，生活的清贫困窘。浦起龙评论说：“这二句，可谓贞士之心，化人之舌，建安而下无此语也。”它出自《诗经·小雅·四月》：“相彼泉水，载清载浊。”但在这首诗中，有多种解释，都有一定的道理。或以新人旧人为清浊，或以前华后憔为清浊，或以在家弃外为清浊，或以守贞为清、改节为浊。还有人认为：佳人以泉水自喻，以山喻夫婿之家，意思是妇人为夫所爱，世人便认为她是清的；为夫所弃，世人便认为她是浊的。另一种解释是佳人怨其夫之辞。人处空谷幽寂之地，就像泉水在山，没有什么能影响其清澈。佳人的丈夫出山，随物流荡，于是就成了山下的浊泉。而她则宁肯受饥寒，也不愿再嫁，成为那浊泉。这就像晋代孙绰《三日兰亭诗序》所说的那样：“古人以水喻性，有旨哉斯谈！非以停之则清，混之则浊邪？情因所习而迁移，物触所遇而兴感。”　　“摘花不插发，采柏动盈掬。天寒翠袖薄，日暮倚修竹。”末尾几句以写景作结，刻画出佳人的孤高和绝世而立，画外有意，象外有情。在体态美中，透露着意态美。这种美，不只是一种女性美，也是古代士大夫追求的一种理想美。诗句暗示读者，这位时乖命蹇的女子，就像那经寒不凋的翠柏、挺拔劲节的绿竹，有着高洁的情操。诗的最后两句，为后人激赏，妙在对美人容貌不着一字形���，仅凭“翠袖”、“修竹”这一对色泽清新而寓有兴寄的意象，与天寒日暮的山中环境相融合，便传神地刻画出佳人不胜清寒、孤寂无依的幽姿高致。　　这首五言古体诗，从开篇一路下来，都是“说”，到了结尾两句，才以一幅画面忽然结束。作者的高明之处，就在这里。他没有拿一个结局去迁就读者的胃口，而是用一个悬念故意吊着读者的胃口。读过这首诗的人，一闭上眼睛，就会在脑海里浮现出这样的画面：一位绝世美貌却格外不幸的佳人，在秋风中，在黄昏里，衣裳单薄，孤伶伶地站在那里，背靠着一丛竹，眼里流露着哀愁。　　在古代，以弃妇为题材的诗文不乏佳作。如《诗经》里的《卫风·氓》，汉乐府里的《上山采蘼芜》等，而司马相如的《长门赋》写被废弃的陈皇后，其中“夫何一佳人兮，步逍遥以自娱”两句，正是杜甫《佳人》诗题的来源。杜甫很少写专咏美人的诗歌，《佳人》却以其格调之高而成为咏美人的名篇。山中清泉见其品质之清，侍婢卖珠见其生计之贫，牵萝补屋见其隐居之志，摘花不戴见其朴素无华，采柏盈掬见其情操贞洁，日暮倚竹见其清高寂寞。诗人以纯客观叙述方法，兼采夹叙夹议和形象比喻等手法，描述了一个在战乱时期被遗弃的上层社会妇女所遭遇的不幸，并在逆境中揭示她的高尚情操，从而使这个人物形象更加丰满。▲这首诗作于唐肃宗乾元二年（759年）秋季，安史之乱发生后的第五年。乾元元年（758年）六月，杜甫由左拾遗降为华州司功参军。第二年七月，他毅然弃官，拖家带口，客居秦州，在那里负薪采橡栗，自给度日，《佳人》就写于这一年的秋季。关于这首诗的作意，一向有争论。有人认为全是寄托，有人则认为是写实，但大部分折衷于二者之间。　　在作此诗之前，杜甫被迫辞掉华州司功参军职务，为生计所迫，携带妻子，翻山来到边远的秦州。杜甫对大唐朝廷，竭忠尽力，丹心耿耿，最后却落得弃官漂泊的窘境。即便是在关山难越、饥寒交迫的情况下，仍始终不忘国家民族的命运。这样的不平际遇，这样的高风亮节，和诗中女主人公展开阅读全文∨这首诗作于唐肃宗乾元二年（759年）秋季，安史之乱发生后的第五年。乾元元年（758年）六月，杜甫由左拾遗降为华州司功参军。第二年七月，他毅然弃官，拖家带口，客居秦州，在那里负薪采橡栗，自给度日，《佳人》就写于这一年的秋季。关于这首诗的作意，一向有争论。有人认为全是寄托，有人则认为是写实，但大部分折衷于二者之间。　　在作此诗之前，杜甫被迫辞掉华州司功参军职务，为生计所迫，携带妻子，翻山来到边远的秦州。杜甫对大唐朝廷，竭忠尽力，丹心耿耿，最后却落得弃官漂泊的窘境。即便是在关山难越、饥寒交迫的情况下，仍始终不忘国家民族的命运。这样的不平际遇，这样的高风亮节，和诗中女主人公是很相像的。所以，作者借他人之酒以浇胸中块垒，在她的身上寄寓了自己的身世之感。清人黄生说：“偶有此人，有此事，适切放臣之感，故作此诗。”▲",
 "诗文": "绝代有佳人，幽居在空谷。自云良家子，零落依草木。关中昔丧乱，兄弟遭杀戮。官高何足论，不得收骨肉。世情恶衰歇，万事随转烛。夫婿轻薄儿，新人美如玉。合昏尚知时，鸳鸯不独宿。但见新人笑，那闻旧人哭。在山泉水清，出山泉水浊。侍婢卖珠回，牵萝补茅屋。摘花不插发，采柏动盈掬。天寒翠袖薄，日暮倚修竹。",
 "作者详情": "杜甫杜甫（712－770），字子美，自号少陵野老，世称“杜工部”、“杜少陵”等，汉族，河南府巩县（今河南省巩义市）人，唐代伟大的现实主义诗人，杜甫被世人尊为“诗圣”，其诗被称为“诗史”。杜甫与李白合称“李杜”，为了跟另外两位诗人李商隐与杜牧即“小李杜”区别开来，杜甫与李白又合称“大李杜”。他忧国忧民，人格高尚，他的约1400余首诗被保留了下来，诗艺精湛，在中国古典诗歌中备受推崇，影响深远。759-766年间曾居成都，后世有杜甫草堂纪念。"
'''
item = '合欢花'
s2   = search_in_baike(item)
print s2
s3 = '''
收藏查看我的收藏0有用+1已投票0[héhūn] 合昏编辑锁定本词条缺少名片图，补充相关内容使词条更完整，还能快速升级，赶紧来编辑吧！合昏，第一层意思是植物名。即合欢树，出自朝梁陆倕《新刻漏铭》，第二层意思是犹黄昏，出处金董解元《西厢记诸宫调》卷三。中文名合昏汉语拼音  héhūn注音  ㄏㄜˊㄏㄨㄣ出    处《新刻漏铭》目录1基本信息2引证解释3相关词语合昏基本信息编辑【汉语文字】合昏【汉语拼音】héhūn【注音】ㄏㄜˊㄏㄨㄣ合昏引证解释编辑1.植物名。即合欢树。南朝梁陆倕《新刻漏铭》：“合昏暮卷，蓂荚晨生。”唐杜甫《佳人》诗：“合昏尚知时，鸳鸯不独宿。”参见“合欢”。2.犹黄昏。金董解元《西厢记诸宫调》卷三：“侵晨等到合昏箇，不曾汤箇水米。”3.犹合婚。结婚。宋洪迈《夷坚甲志·张夫人》：“张为大司成，邓洵仁右丞欲嫁以女，张力辞。邓公方有宠，取中旨令合昏。” 4.合昏：即马缨花，又名合欢、夜合，豆科乔木，羽状复叶，早晨展开入夜入夜复合在一起。出自《佳人》作者：杜甫“合昏尚知时，鸳鸯不独宿。”故称”知时“。合昏相关词语编辑【同音词】合婚、和婚【开头相同】合下手、合欢竹、合城、合契、合色鞋、合指、合掌、合欢袴、合欢被、合亲、合坐、合伙、合龙门、合拢、合稀泥、合葬、合溜、合冬。【结尾相同】圆合、诣合、驩合、联合、里应外合、牵强附合、簇合、寡合、猬合、匡合、瓦合、闺合、作合、碌碌寡合、闇合、香合、理合、令合。参考资料1.  合昏 ．汉典[引用日期2013-02-01]词条标签：语言，字词

'''
from jieba import analyse
# 引入TF-IDF关键词抽取接口
tfidf = analyse.extract_tags

# 原始文本
text = '''
收藏查看我的收藏0有用+1已投票0合欢花编辑锁定合欢花（拉丁学名：AlbizziajulibrissinDurazz.）是豆科，合欢属落叶乔木，喜温暖湿润和阳光充足环境，气微香，味淡。产中国东北至华南及西南部各省区。生于山坡或栽培。非洲、中亚至东亚均有分布；北美亦有栽培。合欢花花丝粉红色，荚果偏，是城市行道树、观赏树。心材黄灰褐色，边材黄白色，耐久，多用于制家具；嫩叶可食，老叶可以洗衣服；树皮供药用，有驱虫之效。它还有宁神作用，主要是治郁结胸闷、失眠健忘、滋阴补阳、眼疾、神经衰弱等功效。 中文学名合欢花拉丁学名AlbizziajulibrissinDurazz.别    称夜合欢、夜合树、绒花树、鸟绒树、苦情花界植物界门被子植物门纲双子叶植物纲亚    纲原始花被亚纲目蔷薇目亚    目蔷薇亚目科豆科亚    科含羞草亚科族印加树族属合欢属种合欢花分布区域中国华东、华南、西南及辽宁、河北、河南、陕西。英文名Albiziaflower目录1植物特征2生长习性3产地分布4栽培技术▪育苗方法▪移植▪田间管理▪病虫防治5主要价值▪药用▪观赏6植物文化▪花语▪传说▪诗词合欢花植物特征编辑合欢果枝花叶图册(20张)落叶乔木，高可达16米，树冠开展；小枝有棱角，嫩枝、花序和叶轴被绒毛或短柔毛。托叶线状披针形，较小叶小，早落。二回羽状复叶，总叶柄近基部及最顶一对羽片着生处各有1枚腺体；羽片4-12对，栽培的有时达20对；小叶10-30对，线形至长圆形，长6-12mm，宽1-4mm，向上偏斜，先端有小尖头，有缘毛，有时在下面或仅中脉上有短柔毛；中脉紧靠上边缘。头状花序于枝顶排成圆锥花序；花粉红色；花萼管状，长3毫米；花冠长8毫米，裂片三角形，长1.5mm，花萼、花冠外均被短柔毛；花丝长2.5cm。荚果带状，长9-15cm，宽1.5-2.5cm，嫩荚有柔毛，老荚无毛。花期6-7月；果期8-10月。 合欢花生长习性编辑合欢为温带、亚热带、热带树种，对气候和土壤适应性较强，喜阳光，不耐阴，生长适温13~18℃，冬季能耐一10℃低温，不耐严寒，不耐涝。对土壤要求不严，较耐干旱、贫瘠土壤，适宜栽植在排水良好、土质疏松的沙质壤土中，其根具有根瘤菌，有改良土壤的能力。属浅根性树种，其萌芽力不强，不耐修剪。  合欢花产地分布编辑产中国东北至华南及西南部各省区。生于山坡或栽培。非洲、中亚至东亚均有分布；北美亦有栽培。 合欢花栽培技术编辑合欢花育苗方法合欢在培育苗木生产中，常采用营养钵育苗法，首先需要配制营养土，可以采用坑塘泥土，或生草皮土经细筛筛后，与肥料混均进行配制。在配制营养土时加入适量微量元素、杀菌剂和杀虫剂对土壤进行处理，从而防止土壤有害生物对种子、幼苗所造成的危害，以保证苗木健康生长。在营养钵育苗时，一般选用南北行向，床距30~40cm，苗床宽度以1~1.2m为宜，营养钵装满营养土后浇1次透水，第2天即可进行播种，合欢营养钵育苗常用点播法，每钵可下种3~4粒，播种后覆土厚度1cm，并保持土壤湿润。 合欢花移植合欢苗育成后，需要进行移植，时间以春季为好，达到“随挖、随栽、随浇”的要求。在移栽过程中要注意保护根系，并做到小心细致，对于大苗移植必要时可撑杆或拉绳扶植，以防止被风刮歪或倾斜生长。为保证成活，对苗木要进行处理，去掉侧枝，仅留主干，定干高度根据不同栽植要求，灵活掌握，一般在3m左右，移栽大苗时要带足土球，并设立支架，防风吹倒伏。栽后立即浇水，晚秋时可在树干周围开沟施肥1次，保证来年生长肥力充足。移植后要适当增加浇水次数，秋季施足底肥，有利于根系生长和来年花叶繁茂。为满足人们对合欢观赏性的要求，每年冬末需进行修剪，去除病虫枝、细弱枝，并对侧枝适量修剪调整，以达到主干端正，树姿优美的效果。栽后加强管理，立即灌透水，促进伤口及时愈合，在日常浇水、施肥等管理过程中尽量减少创伤口。旱时浇水，雨后排涝，定期施肥，增强植株长势，提高抗病能力。 合欢花田间管理合欢花为喜光树种，稍耐阴，所以在生长期要注意提供充足的阳光照射，但夏季光照过强时也要注意遮阴。合欢花喜欢温暖的环境，但其抗寒能力非常强，在南方地区冬天是不需要移入温室的。合欢花土壤要求不严，但以肥沃湿润、排水良好的沙壤土和石灰岩地壤土为佳。合欢花耐干燥，不耐水涝，养护期间浇水不要过多，以免造成水涝，损伤根系。合欢花可以实行粗放管理，对水肥的要求不是很高，即使是贫瘠地区也可能生长的非常旺盛。但需要注意的是，它不喜噪音以及灰尘，因此在养殖时需要在这上面把好关口。 合欢花病虫防治合欢常见病害有枯萎病和溃疡病，大树移栽时，减少起苗与运输、定植时间，栽前对根部进行杀菌消毒，可喷洒40%多菌灵可湿性粉剂500倍液，或65%代森锌可湿性粉剂500倍液；移栽时，可用10%硫酸铜溶液蘸根处理，也可同时喷施生根粉等生长调节剂，以促进根系萌发生长。对于已截过的枝干断面，涂抹保护剂防治病菌侵入。可采用70%甲基托布津可湿性粉、60%多福可湿性粉100倍液喷洒树干或涂抹；或使用14.5%多效灵水溶性粉剂、40%五氯硝基苯粉剂300倍液，以及抗枯宁、甲基托布津、多菌灵等农药常规浓度浇灌土壤，每8天左右灌1次，连续3~4次可有效遏制病情扩展，并使植株逐步恢复；而使用70%基托布津可湿性粉剂300倍液，通过输液的方式输入植株内，呵提高疗效。在采取以上措施的同时，对树穴及周围相邻土壤浇灌40%福美胂50倍液、40%五氯硝基苯粉剂300倍液，进行消毒，防止病菌蔓延。 虫害有吹绵蚧、天牛、尺蠖和叶蝉，可用65%噻嗪酮可湿性粉剂800~1000倍喷雾防治吹绵蚧，叶蝉在若虫发生期，采用喷洒10%吡虫啉2000~3000倍液，和1.8%阿维虫清2000~3000倍液，40%氧化乐果乳油1000。1500倍液或20%杀灭菊酯2000倍液，以及20%氰戊菊酯乳油3000倍液分别进行了对比试验，均取得了较好的防治效果。 合欢花主要价值编辑合欢花药用合欢花含有合欢甙，鞣质，解郁安神，滋阴补阳，理气开胃，活络止痛，用于、忧郁失眠。治郁结胸闷，失眠，健忘，风火眼，能安五脏，和心志，悦颜色，有较好的强身、镇静、安神、美容的作用，是治疗神经衰弱的佳品。具有清热解暑，养颜祛斑解酒等功效。 中医认为：合欢花性味甘，平，舒郁、理气、安神、活络、养血、滋阴肾、清心明目。①《神农本草经》：“合欢，安五脏，和心志，令人欢乐无忧。”②《本草便读》：“能养血、活气、通脉。”③《分类草药性》：“能清心明目、滋肾阴。”④《四川中药志》：“能合心志，开胃理气，消风明目，解郁安神，治失眠，调肾虚。”⑤江西《中草药学》：“解郁安神，和络止痛。治肝郁胸闷，忧而不乐，健忘失眠，性欲寡淡。”⑥《东北常用中草药手册》：“通气活肾，养血消仲痛。” 合欢花观赏合欢花树形姿势优美，叶形雅致，树冠开阔，入夏绿荫清幽，羽状复叶昼开夜合，十分清奇，夏日粉红色绒花吐艳，十分美丽，有色有香，能形成轻柔舒畅的气氛，宜作庭荫树、行道树，种植于林缘、房前、草坪、山坡等地。是行道树、庭荫树、四旁绿化和庭园点缀的观赏佳树此外，合欢对氯化氢，二氧化抗性强���对二氧化硫有一定抗性，适于厂矿、街道绿化。 合欢花植物文化编辑合欢花花语“合欢”寓意“言归于好，合家欢乐”之美意，合欢花象征永远恩爱、两两相对、是夫妻好合的象征。 合欢花传说相传虞舜南巡仓梧而死，其妃娥皇、女英遍寻湘江，终未寻见。二妃终日恸哭，泪尽滴血，血尽而死，逐为其神。后来，人们发现她们的精灵与虞舜的精灵“合二为一”，变成了合欢树。合欢树叶，昼开夜合，相亲相爱。自此，人们常以合欢表示忠贞不渝的爱情。 合欢花诗词明·李东阳唐·韦庄清·纳兰性德　 词条图册更多图册参考资料1.  吴冰.合欢生物学特性及栽培管理技术[J].《农业与技术》,2012年7期..2.  合欢 ．中国植物物种数据库[引用日期2013-11-14]3.  合欢 ．中国植物志[引用日期2013-11-27]4.  邓运川,王瑞林.合欢的栽培管理技术[J].《南方农业(园林花卉版)》,2010年2期.5.  合欢 ．中国植物物种信息数据库[引用日期2013-11-27]6.  【每日一花】学校代表性花卉评选之合欢花 ．大工新闻网[引用日期2014-09-15]词条标签：生物物种，植物，中药
'''

# 基于TF-IDF算法进行关键词抽取
keywords = tfidf(text)
print "keywords by tfidf:"
# 输出抽取出的关键词
for keyword in keywords:
    print keyword + "/",
text = s3
print ' '
print '*'*30
# 基于TF-IDF算法进行关键词抽取
keywords = tfidf(text)
print "keywords by tfidf:"
# 输出抽取出的关键词
for keyword in keywords:
    print keyword + "/",

