# -*- coding:utf-8 -*-  
'''
Created on 2017年10月18日

@author: Administrator
'''
def input_question():
#     input_text = raw_input('输入：')
#     return input_text.split(' ')
#“咬定青山不放松 ,立根原在破岩中。千磨万 击还坚劲 ，任尔东西南北 风。”描写的是哪种植物?A 松树 B 梅花 C 竹子
#     return {
#         '题目':'“罗浮山下四 时春”的下一句是什么? ',
#         '选项':'0',
#         'A':'',
#         'B':'',
#         'C':'',
#         'D':'', 
#         }
    return {
        '题目':'“合昏尚知时，鸳鸯不独宿。但 见新人笑，那 闻旧人哭。”中的“合昏”指的是',
        '选项':'3',
        'A':'合欢花',
        'B':'夜来香',
        'C':'夕颜',
        'D':'', 
        }
# return {
#       '题目':'“咬定青山不放松 ,立根原在破岩中。千磨万 击还坚劲 ，任尔东西南北 风。”描写的是哪种植物? ',
#       '选项':'3',
#       'A':'松树',
#       'B':'梅花',
#       'C':'竹子',
#       'D':'', 
#       } 
#     pass
